apache/nuttx/arch/arm/src/lpc54xx/lpc54_sdmmc.c
/* Let's wait until we have both SD card transfer complete and DMA
 * complete.
 */

#define SDCARD_XFRDONE_FLAG     (1)
#define SDCARD_DMADONE_FLAG     (2)
#define SDCARD_ALLDONE          (3)

/* Card debounce time.  Number of host clocks (SD_CLK) used by debounce
 * filter logic for card detect.  typical debounce time is 5-25 ms.
 *
 * Eg. Fsd = 44MHz, ticks = 660,000
 */

#define DEBOUNCE_TICKS          (15 * (BOARD_SDMMC_FREQUENCY / 1000))

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct sdmmc_dma_s
{
  volatile uint32_t des0;        /* Control and status */
  volatile uint32_t des1;        /* Buffer size(s) */
  volatile uint32_t des2;        /* Buffer address pointer 1 */
  volatile uint32_t des3;        /* Buffer address pointer 2 */
};

/* This structure defines the state of the LPC54XX SD card interface */

struct lpc54_dev_s
{
  struct sdio_dev_s  dev;             /* Standard, base SD card interface */

  /* LPC54XX-specific extensions */

  /* Event support */

  sem_t              waitsem;         /* Implements event waiting */
  sdio_eventset_t    waitevents;      /* Set of events to be waited for */
  uint32_t           waitmask;        /* Interrupt enables for event waiting */
  volatile sdio_eventset_t wkupevent; /* The event that caused the wakeup */
  struct wdog_s      waitwdog;        /* Watchdog that handles event timeouts */

  /* Callback support */

  sdio_statset_t     cdstatus;        /* Card status */
  sdio_eventset_t    cbevents;        /* Set of events to be cause callbacks */
  worker_t           callback;        /* Registered callback function */
  void              *cbarg;           /* Registered callback argument */
  struct work_s      cbwork;          /* Callback work queue structure */

  /* Interrupt mode data transfer support */

  uint32_t          *buffer;          /* Address of current R/W buffer */
  uint32_t           xfrmask;         /* Interrupt enables for data transfer */
#ifdef CONFIG_LPC54_SDMMC_DMA
  uint32_t           dmamask;         /* Interrupt enables for DMA transfer */
#endif
  ssize_t            remaining;       /* Number of bytes remaining in the
                                       * transfer */
  bool               wrdir;           /* True: Writing False: Reading */

  /* DMA data transfer support */

  bool               widebus;         /* Required for DMA support */
#ifdef CONFIG_LPC54_SDMMC_DMA
  bool               dmamode;         /* true: DMA mode transfer */
#endif
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

#ifdef CONFIG_LPC54_SDMMC_REGDEBUG
static uint32_t lpc54_getreg(uint32_t addr);
static void lpc54_putreg(uint32_t val, uint32_t addr);
#else
#  define lpc54_getreg(addr)     getreg32(addr)
#  define lpc54_putreg(val,addr) putreg32(val,addr)
#endif

/* Low-level helpers ********************************************************/

static inline void lpc54_setclock(uint32_t clkdiv);
static inline void lpc54_sdcard_clock(bool enable);
static int  lpc54_ciu_sendcmd(uint32_t cmd, uint32_t arg);
static void lpc54_enable_ints(struct lpc54_dev_s *priv);
static void lpc54_disable_allints(struct lpc54_dev_s *priv);
static void lpc54_config_waitints(struct lpc54_dev_s *priv,
              uint32_t waitmask, sdio_eventset_t waitevents,
              sdio_eventset_t wkupevents);
static void lpc54_config_xfrints(struct lpc54_dev_s *priv, uint32_t xfrmask);
#ifdef CONFIG_LPC54_SDMMC_DMA
static void lpc54_config_dmaints(struct lpc54_dev_s *priv, uint32_t xfrmask,
                                 uint32_t dmamask);
#endif

/* Data Transfer Helpers ****************************************************/

static void lpc54_eventtimeout(wdparm_t arg);
static void lpc54_endwait(struct lpc54_dev_s *priv,
              sdio_eventset_t wkupevent);
static void lpc54_endtransfer(struct lpc54_dev_s *priv,
              sdio_eventset_t wkupevent);

/* Interrupt Handling *******************************************************/

static int  lpc54_sdmmc_interrupt(int irq, void *context, void *arg);

/* SD Card Interface Methods ************************************************/

/* Mutual exclusion */

#ifdef CONFIG_SDIO_MUXBUS
static int  lpc54_lock(struct sdio_dev_s *dev, bool lock);
#endif

/* Initialization/setup */

static void lpc54_reset(struct sdio_dev_s *dev);
static sdio_capset_t lpc54_capabilities(struct sdio_dev_s *dev);
static uint8_t lpc54_status(struct sdio_dev_s *dev);
static void lpc54_widebus(struct sdio_dev_s *dev, bool enable);
static void lpc54_clock(struct sdio_dev_s *dev,
              enum sdio_clock_e rate);
static int  lpc54_attach(struct sdio_dev_s *dev);

/* Command/Status/Data Transfer */

static int  lpc54_sendcmd(struct sdio_dev_s *dev, uint32_t cmd,
              uint32_t arg);
#ifdef CONFIG_SDIO_BLOCKSETUP
static void lpc54_blocksetup(struct sdio_dev_s *dev,
              unsigned int blocklen, unsigned int nblocks);
#endif
static int  lpc54_recvsetup(struct sdio_dev_s *dev, uint8_t *buffer,
              size_t nbytes);
static int  lpc54_sendsetup(struct sdio_dev_s *dev,
              const uint8_t *buffer, uint32_t nbytes);
static int  lpc54_cancel(struct sdio_dev_s *dev);

static int  lpc54_waitresponse(struct sdio_dev_s *dev, uint32_t cmd);
static int  lpc54_recvshortcrc(struct sdio_dev_s *dev, uint32_t cmd,
              uint32_t *rshort);
static int  lpc54_recvlong(struct sdio_dev_s *dev, uint32_t cmd,
              uint32_t rlong[4]);
static int  lpc54_recvshort(struct sdio_dev_s *dev, uint32_t cmd,
              uint32_t *rshort);
static int  lpc54_recvnotimpl(struct sdio_dev_s *dev, uint32_t cmd,
              uint32_t *rnotimpl);

/* EVENT handler */

static void lpc54_waitenable(struct sdio_dev_s *dev,
              sdio_eventset_t eventset, uint32_t timeout);
static sdio_eventset_t lpc54_eventwait(struct sdio_dev_s *dev);
static void lpc54_callbackenable(struct sdio_dev_s *dev,
              sdio_eventset_t eventset);
static void lpc54_callback(struct lpc54_dev_s *priv);
static int  lpc54_registercallback(struct sdio_dev_s *dev,
              worker_t callback, void *arg);

#ifdef CONFIG_LPC54_SDMMC_DMA
/* DMA */

static int  lpc54_dmarecvsetup(struct sdio_dev_s *dev,
              uint8_t *buffer, size_t buflen);
static int  lpc54_dmasendsetup(struct sdio_dev_s *dev,
              const uint8_t *buffer, size_t buflen);
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/

struct lpc54_dev_s g_scard_dev =
{
  .dev =
  {
#ifdef CONFIG_SDIO_MUXBUS
    .lock             = lpc54_lock,
#endif
    .reset            = lpc54_reset,
    .capabilities     = lpc54_capabilities,
    .status           = lpc54_status,
    .widebus          = lpc54_widebus,
    .clock            = lpc54_clock,
    .attach           = lpc54_attach,
    .sendcmd          = lpc54_sendcmd,
#ifdef CONFIG_SDIO_BLOCKSETUP
    .blocksetup       = lpc54_blocksetup,
#endif
    .recvsetup        = lpc54_recvsetup,
    .sendsetup        = lpc54_sendsetup,
    .cancel           = lpc54_cancel,
    .waitresponse     = lpc54_waitresponse,
    .recv_r1          = lpc54_recvshortcrc,
    .recv_r2          = lpc54_recvlong,
    .recv_r3          = lpc54_recvshort,
    .recv_r4          = lpc54_recvnotimpl,
    .recv_r5          = lpc54_recvnotimpl,
    .recv_r6          = lpc54_recvshortcrc,
    .recv_r7          = lpc54_recvshort,
    .waitenable       = lpc54_waitenable,
    .eventwait        = lpc54_eventwait,
    .callbackenable   = lpc54_callbackenable,
    .registercallback = lpc54_registercallback,
#ifdef CONFIG_LPC54_SDMMC_DMA
    .dmarecvsetup     = lpc54_dmarecvsetup,
    .dmasendsetup     = lpc54_dmasendsetup,
#endif
  },
  .waitsem = SEM_INITIALIZER(0),
};

#ifdef CONFIG_LPC54_SDMMC_DMA
static struct sdmmc_dma_s g_sdmmc_dmadd[NUM_DMA_DESCRIPTORS];
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: lpc54_getreg
 *
 * Description:
 *   This function may to used to intercept an monitor all register accesses.
 *   Clearly this is nothing you would want to do unless you are debugging
 *   this driver.
 *
 * Input Parameters:
 *   addr - The register address to read
 *
 * Returned Value:
 *   The value read from the register
 *
 ****************************************************************************/

#ifdef CONFIG_LPC54_SDMMC_REGDEBUG
static uint32_t lpc54_getreg(uint32_t addr)
{
  static uint32_t prevaddr = 0;
  static uint32_t preval   = 0;
  static uint32_t count    = 0;

  /* Read the value from the register */

  uint32_t val = getreg32(addr);

  /* Is this the same value that we read from the same register last time?
   * Are we polling the register?  If so, suppress some of the output.
   */

  if (addr == prevaddr && val == preval)
    {
      if (count == 0xffffffff || ++count > 3)
        {
          if (count == 4)
            {
              mcinfo("...\n");
            }

          return val;
        }
    }

  /* No this is a new address or value */

  else
    {
      /* Did we print "..." for the previous value? */

