apache/nuttx/arch/arm/src/lpc54xx/lpc54_sdmmc.c
  /* Configure the FIFO so that we will receive the DMA/FIFO requests
   * whenever there are FIFO_DEPTH/2 or fewer words in the FIFO.
   */

  regval = SDMMC_FIFOTH_TXWMARK(LPC54_TXFIFO_DEPTH / 2) |
           SDMMC_FIFOTH_DMABURST_4XFRS;
  lpc54_putreg(regval, LPC54_SDMMC_FIFOTH);

  /* Setup DMA descriptor list */

  i = 0;
  while (buflen > 0)
    {
      /* Limit size of the transfer to maximum buffer size */

      maxs = buflen;

      if (maxs > MCI_DMADES1_MAXTR)
        {
          maxs = MCI_DMADES1_MAXTR;
        }

      buflen -= maxs;

      /* Set buffer size */

      g_sdmmc_dmadd[i].des1 = MCI_DMADES1_BS1(maxs);

      /* Setup buffer address (chained) */

      g_sdmmc_dmadd[i].des2 = (uint32_t)priv->buffer +
                              (i * MCI_DMADES1_MAXTR);

      /* Setup basic control */

      ctrl = MCI_DMADES0_OWN | MCI_DMADES0_CH;

      if (i == 0)
        {
          ctrl |= MCI_DMADES0_FS; /* First DMA buffer */
        }

      /* No more data?  Then this is the last descriptor */

      if (buflen == 0)
        {
          ctrl |= MCI_DMADES0_LD;
          g_sdmmc_dmadd[i].des3 = 0;
        }
      else
        {
          ctrl |= MCI_DMADES0_DIC;
          g_sdmmc_dmadd[i].des3 = (uint32_t)&g_sdmmc_dmadd[i + 1];
        }

      g_sdmmc_dmadd[i].des0 = ctrl;
      i++;
    }

  DEBUGASSERT(i < NUM_DMA_DESCRIPTORS);

  lpc54_putreg((uint32_t) &g_sdmmc_dmadd[0], LPC54_SDMMC_DBADDR);

  /* Flush ints before we start */

  lpc54_putreg(SDCARD_TRANSFER_ALL, LPC54_SDMMC_RINTSTS);

  /* Enable internal DMA, burst size of 4, fixed burst */

  regval  = lpc54_getreg(LPC54_SDMMC_CTRL);
  regval |= SDMMC_CTRL_INTDMA;
  lpc54_putreg(regval, LPC54_SDMMC_CTRL);

  regval = SDMMC_BMOD_DE | SDMMC_BMOD_PBL_4XFRS;
  lpc54_putreg(regval, LPC54_SDMMC_BMOD);

  /* Setup DMA error interrupts */

  lpc54_config_dmaints(priv, SDCARD_DMASEND_MASK, SDCARD_DMAERROR_MASK);
  return OK;
}
#endif

/****************************************************************************
 * Name: lpc54_callback
 *
 * Description:
 *   Perform callback.
 *
 * Assumptions:
 *   This function does not execute in the context of an interrupt handler.
 *   It may be invoked on any user thread or scheduled on the work thread
 *   from an interrupt handler.
 *
 ****************************************************************************/

static void lpc54_callback(struct lpc54_dev_s *priv)
{
  /* Is a callback registered? */

  mcinfo("Callback %p(%p) cbevents: %02x cdstatus: %02x\n",
         priv->callback, priv->cbarg, priv->cbevents, priv->cdstatus);

  if (priv->callback)
    {
      /* Yes.. Check for enabled callback events */

      if ((priv->cdstatus & SDIO_STATUS_PRESENT) != 0)
        {
          /* Media is present.  Is the media inserted event enabled? */

          if ((priv->cbevents & SDIOMEDIA_INSERTED) == 0)
            {
              /* No... return without performing the callback */

              return;
            }
        }
      else
        {
          /* Media is not present.  Is the media eject event enabled? */

          if ((priv->cbevents & SDIOMEDIA_EJECTED) == 0)
            {
              /* No... return without performing the callback */

              return;
            }
        }

      /* Perform the callback, disabling further callbacks.  Of course, the
       * the callback can (and probably should) re-enable callbacks.
       */

      priv->cbevents = 0;

      /* Callbacks cannot be performed in the context of an interrupt
       * handler.  If we are in an interrupt handler, then queue the
       * callback to be performed later on the work thread.
       */

      if (up_interrupt_context())
        {
          /* Yes.. queue it */

          mcinfo("Queuing callback to %p(%p)\n",
                 priv->callback, priv->cbarg);
          work_queue(HPWORK, &priv->cbwork, priv->callback,
                     priv->cbarg, 0);
        }
      else
        {
          /* No.. then just call the callback here */

          mcinfo("Callback to %p(%p)\n", priv->callback, priv->cbarg);
          priv->callback(priv->cbarg);
        }
    }
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: lpc54_sdmmc_initialize
 *
 * Description:
 *   Initialize the SD/MMC peripheral for normal operation.
 *
 * Input Parameters:
 *   slotno - Not used.
 *
 * Returned Value:
 *   A reference to an SD card interface structure.  NULL is returned on
 *   failures.
 *
 ****************************************************************************/

struct sdio_dev_s *lpc54_sdmmc_initialize(int slotno)
{
  struct lpc54_dev_s *priv = &g_scard_dev;
  irqstate_t flags;
  uint32_t regval;

  mcinfo("slotno=%d\n", slotno);
  flags = enter_critical_section();

  /* Set the SD/MMMC clock source */

  lpc54_putreg(BOARD_SDMMC_CLKSRC, LPC54_SYSCON_SDIOCLKSEL);

  /* Set up the clock divider to obtain the desired clock rate.
   * NOTE: The SDIO function clock to the interface can be up to 50 MHZ.
   */

  regval = SYSCON_SDIOCLKDIV_DIV(BOARD_SDMMC_CLKDIV);
  lpc54_putreg(regval, LPC54_SYSCON_SDIOCLKDIV);
  lpc54_putreg(regval | SYSCON_SDIOCLKDIV_REQFLAG, LPC54_SYSCON_SDIOCLKDIV);

  /* Set delay values on the sample and drive inputs and outputs using the
   * SDIOCLKCTRL register in the SYSCON block.
   */

  regval = SYSCON_SDIOCLKCTRL_DRVPHASE_DEFAULT |
           SYSCON_SDIOCLKCTRL_SMPPHASE_DEFAULT |
           SYSCON_SDIOCLKCTRL_DRVDLY_DEFAULT |
           SYSCON_SDIOCLKCTRL_SMPDLY_DEFAULT;
  lpc54_putreg(regval, LPC54_SYSCON_SDIOCLKCTRL);

  /* Enable clocking to the SD/MMC peripheral */

  lpc54_sdmmc_enableclk();

  /* Configure GPIOs for 4-bit, wide-bus operation */

  lpc54_gpio_config(GPIO_SD_D0);
#ifndef CONFIG_SDIO_WIDTH_D1_ONLY
  lpc54_gpio_config(GPIO_SD_D1);
  lpc54_gpio_config(GPIO_SD_D2);
  lpc54_gpio_config(GPIO_SD_D3);
#endif
#ifdef CONFIG_MMCSD_HAVE_CARDDETECT
  lpc54_gpio_config(GPIO_SD_CARD_DET_N);
#endif
  lpc54_gpio_config(GPIO_SD_CLK);
  lpc54_gpio_config(GPIO_SD_CMD);
#ifdef CONFIG_LPC54_SDMMC_PWRCTRL
  lpc54_gpio_config(GPIO_SD_POW_EN);
#endif
#ifdef CONFIG_MMCSD_HAVE_WRITEPROTECT
  lpc54_gpio_config(GPIO_SD_WR_PRT);
#endif

#ifndef CONFIG_SDIO_WIDTH_D1_ONLY
  /* REVISIT: Due to chip errata, Rev. 1.7, Issue 3.7, DAT4-7 must also be
   * configured.  Otherwise the SD interface will not work.
   */

  lpc54_gpio_config(GPIO_SD_D4);
  lpc54_gpio_config(GPIO_SD_D5);
  lpc54_gpio_config(GPIO_SD_D6);
  lpc54_gpio_config(GPIO_SD_D7);
#endif

  /* Reset the card and assure that it is in the initial, unconfigured
   * state.
   */

  lpc54_reset(&priv->dev);

  leave_critical_section(flags);
  return &g_scard_dev.dev;
}

#endif /* CONFIG_LPC54_SDMMC */
